CREATE DATABASE student;

USE student;

CREATE TABLE autorize
(
	Id int,
    Login varchar(40),
    Pass varchar(40)
);

CREATE TABLE oblast
(
	Id int,
    Oblast varchar(20)
);

CREATE TABLE gorod
(
	Id int,
    Gorod varchar(20)
);

CREATE TABLE rayon
(
	Id int,
    Rayon varchar(50)
);

CREATE TABLE specialnost
(
	Id int,
    Specialnost varchar(100)
);

CREATE TABLE obshaga
(
	Id int,
    Adress varchar(100)
);

CREATE TABLE inyaz
(
	Id int,
    Yazik varchar(20)
);

CREATE TABLE formaobuch
(
	Id int,
    Formaobuch varchar(15)
);

CREATE TABLE obooso
(
	Id int,
    Obooso varchar(10)
);

CREATE TABLE kurs
(
	Id int,
    Kurs int
);

CREATE TABLE budjet
(
	Id int,
    Budjet varchar(15)
);

CREATE TABLE pol
(
	Id int,
    Pol varchar(10)
);

CREATE TABLE celevik
(
	Id int,
    Celevik varchar(10)
);

CREATE TABLE ycheniki
(
	Id INT,
    Specialnost VARCHAR(100),
    Formaobuch VARCHAR(20),
    Obooso VARCHAR (10),
    Kurs INT,
    NumberOfGroup VARCHAR(10),
    Budget VARCHAR (10),
    AdresObshagi VARCHAR (100),
    Pol VARCHAR (10),
    Familia VARCHAR (30),
    Imya VARCHAR (15),
    Otchestvo VARCHAR (30),
    DataRojdenia VARCHAR (15),
    PassData VARCHAR (50),
    SredniyBallPosleSchool VARCHAR (10),
    Inyaz VARCHAR (15),
    MobilniyTel VARCHAR (40),
    Oblast VARCHAR (15),
    Gorod VARCHAR (15),
    Rayon VARCHAR (30),
    AdresProjiv VARCHAR (100),
    SredniyBall VARCHAR (10),
    Celevik VARCHAR (10),
    Roditeli VARCHAR (250),
    MestoRaboty VARCHAR (250),
    Ligoty VARCHAR (250),
    Primechanie VARCHAR (250),
    NumPrikaza VARCHAR (50),
    DataPerevoda VARCHAR (20),
    DataZachisleniya VARCHAR (20)
);

CREATE TABLE otchislen
(
	Id INT,
    Specialnost VARCHAR(100),
    Formaobuch VARCHAR(20),
    Obooso VARCHAR (10),
    Kurs INT,
    NumberOfGroup VARCHAR(10),
    Budget VARCHAR (10),
    AdresObshagi VARCHAR (100),
    Pol VARCHAR (10),
    Familia VARCHAR (30),
    Imya VARCHAR (15),
    Otchestvo VARCHAR (30),
    DataRojdenia VARCHAR (15),
    PassData VARCHAR (50),
    SredniyBallPosleSchool VARCHAR (10),
    Inyaz VARCHAR (15),
    MobilniyTel VARCHAR (40),
    Oblast VARCHAR (15),
    Gorod VARCHAR (15),
    Rayon VARCHAR (30),
    AdresProjiv VARCHAR (100),
    SredniyBall VARCHAR (10),
    Celevik VARCHAR (10),
    Roditeli VARCHAR (250),
    MestoRaboty VARCHAR (250),
    Ligoty VARCHAR (250),
    Primechanie VARCHAR (250),
    NumPrikaza VARCHAR (50),
    DataOtchislenya VARCHAR (20)
);

INSERT autorize (Id, Login, Pass) 
VALUES
(0,'19df4fbc3a','19df4fbc3a'),
(1,'19df4fbc3a','19df4fbc3a');

INSERT budjet (Id, Budjet) 
VALUES
(0,''),
(1,'Бюджет'),
(2,'Комерч');

INSERT celevik (Id, Celevik) 
VALUES
(0,''),
(1,'Да'),
(2,'Нет');

INSERT formaobuch (Id, Formaobuch) 
VALUES
(0,''),
(1,'ДФО'),
(2,'ЗФО');

INSERT gorod (Id, Gorod) 
VALUES
(0,''),
(1,'Брест'),
(2,'Барановичи'),
(3,'Пинск'),
(4,'Кобрин'),
(5,'Берёза'),
(6,'Лунинец'),
(7,'Ивацевичи'),
(8,'Пружаны'),
(9,'Иваново'),
(10,'Дрогичин'),
(11,'Ганцевичи'),
(12,'Жабинка'),
(13,'Микашевичи'),
(14,'Белоозёрск'),
(15,'Столин'),
(16,'Малорита'),
(17,'Ляховичи'),
(18,'Каменец'),
(19,'Давид-Городок'),
(20,'Высокое'),
(21,'Коссово'),
(22,'Витебск'),
(23,'Орша'),
(24,'Новополоцк'),
(25,'Полоцк'),
(26,'Поставы'),
(27,'Глубокое'),
(28,'Лепель'),
(29,'Новолукомль'),
(30,'Городок'),
(31,'Барань'),
(32,'Толочин'),
(33,'Браслав'),
(34,'Чашники'),
(35,'Миоры'),
(36,'Дубровно'),
(37,'Сенно'),
(38,'Верхнедвинск'),
(39,'Докшицы'),
(40,'Дисна'),
(41,'Гомель'),
(42,'Мозырь'),
(43,'Жлобин'),
(44,'Светлогорск'),
(45,'Речица'),
(46,'Калинковичи'),
(47,'Рогачёв'),
(48,'Добруш'),
(49,'Житковичи'),
(50,'Хойники'),
(51,'Петриков'),
(52,'Ельск'),
(53,'Буда-Кошелёво'),
(54,'Наровля'),
(55,'Ветка'),
(56,'Чечерск'),
(57,'Василевичи'),
(58,'Туров'),
(59,'Гродно'),
(60,'Лида'),
(61,'Слоним'),
(62,'Волковыск'),
(63,'Сморгонь'),
(64,'Новогрудок'),
(65,'Мосты'),
(66,'Щучин'),
(67,'Oшмяны'),
(68,'Скидель'),
(69,'Берёзовка'),
(70,'Островец'),
(71,'Ивье'),
(72,'Дятлово'),
(73,'Свислочь'),
(75,'Минск'),
(76,'Борисов'),
(77,'Солигорск'),
(78,'Молодечно'),
(79,'Жодино'),
(80,'Слуцк'),
(81,'Вилейка'),
(82,'Дзержинск'),
(83,'Марьина Горка'),
(84,'Столбцы'),
(85,'Смолевичи'),
(86,'Несвиж'),
(87,'Заславль'),
(88,'Фаниполь'),
(89,'Березино'),
(90,'Любань'),
(91,'Старые Дороги'),
(92,'Логойск'),
(93,'Клецк'),
(94,'Воложин'),
(95,'Узда'),
(96,'Червень'),
(97,'Копыль'),
(98,'Крупки'),
(99,'Мядель'),
(100,'Могилёв'),
(101,'Бобруйск'),
(102,'Горки'),
(103,'Осиповичи'),
(104,'Кричев'),
(105,'Быхов'),
(106,'Климовичи'),
(107,'Шклов'),
(108,'Костюковичи'),
(109,'Чаусы'),
(110,'Мстиславль'),
(111,'Белыничи'),
(112,'Кировск'),
(113,'Чериков'),
(114,'Славгород'),
(115,'Круглое'),
(116,'Кличев');

INSERT inyaz (Id, Yazik) 
VALUES
(0,''),
(1,'Английский'),
(2,'Немецкий'),
(3,'Французский');

INSERT kurs (Id, Kurs) 
VALUES
(0,null),
(1,1),
(2,2),
(3,3),
(4,4);

INSERT oblast (Id, Oblast) 
VALUES
(0,''),
(1,'Брестская'),
(2,'Витебская'),
(3,'Гомельская'),
(4,'Гродненская'),
(5,'Минская'),
(6,'Могилевская');

INSERT obooso (Id, Obooso) 
VALUES
(0,''),
(1,'ОБО'),
(2,'ОСО');

INSERT obshaga (Id, Adress) 
VALUES
(0,''),
(1,'г.Пинск, ул. Партизанская, 13.'),
(2,'г.Пинск, ул. Кирова, 34.');

INSERT pol (Id, Pol) 
VALUES
(0,''),
(1,'М'),
(2,'Ж');

INSERT specialnost (Id, Specialnost) 
VALUES
(0, ''),
(1,'Мелиорация и водное хозяйство'),
(2, 'Техническое обеспечение мелиоративных и водохозяйственных работ'),
(3, 'Ремонтно-обслуживающее производство в сельском хозяйстве'),
(4, 'Промышленное и гражданское строительство'),
(5, 'Строительство дорог и транспортных объектов');

INSERT rayon (Id, Rayon) 
VALUES
(0,''),
(1,'Барановичский'),
(2,'Берёзовский'),
(3,'Брестский'),
(4,'Брест - Ленинский'),
(5,'Брест - Московский'),
(6,'Ганцевичский'),
(7,'Дрогичинский'),
(8,'Жабинковский'),
(9,'Ивановский'),
(10,'Ивацевичский'),
(11,'Каменецкий'),
(12,'Кобринский'),
(13,'Лунинецкий'),
(14,'Ляховичский'),
(15,'Малоритский'),
(16,'Пинский'),
(17,'Пружанский'),
(18,'Столинский'),
(19,'Бешенковичский'),
(20,'Браславский'),
(21,'Верхнедвинский'),
(22,'Витебский'),
(23,'Витебск - Железнодорожный'),
(24,'Витебск - Первомайский'),
(25,'Витебск - Октябрьский'),
(26,'Глубокский'),
(27,'Городокский'),
(28,'Докшицкий'),
(29,'Дубровенский'),
(30,'Лепельский'),
(31,'Лиозненский'),
(32,'Миорский'),
(33,'Оршанский'),
(34,'Полоцкий'),
(35,'Поставский'),
(36,'Россонский'),
(37,'Сенненский'),
(38,'Толочинский'),
(39,'Ушачский'),
(40,'Чашникский'),
(41,'Шарковщинский'),
(42,'Шумилинский'),
(43,'Брагинский'),
(44,'Буда-Кошелевский'),
(45,'Ветковский'),
(46,'Гомельский'),
(47,'Гомель - Новебелицкий'),
(48,'Гомель - Советский'),
(49,'Гомель - Центральный'),
(50,'Добрушский'),
(51,'Ельский'),
(52,'Житковичский'),
(53,'Жлобинский'),
(54,'Калинковичский'),
(55,'Кормянский'),
(56,'Лельчицкий'),
(57,'Лоевский'),
(58,'Мозырский'),
(59,'Наровлянский'),
(60,'Октябрьский'),
(61,'Петриковский'),
(62,'Речицкий'),
(63,'Рогачевский'),
(64,'Светлогорский'),
(65,'Хойникский'),
(66,'Чечерский'),
(67,'Берестовицкий'),
(68,'Волковысский'),
(69,'Вороновский'),
(70,'Гродненский'),
(71,'Гродно - Ленинский'),
(72,'Гродно - Октябрьский'),
(73,'Дятловский'),
(74,'Зельвенский'),
(75,'Ивьевский'),
(76,'Кореличский'),
(77,'Лидский'),
(78,'Мостовский'),
(79,'Новогрудский'),
(80,'Островецкий'),
(81,'Ошмянский'),
(82,'Свислочский'),
(83,'Слонимский'),
(84,'Сморгонский'),
(85,'Щучинский'),
(86,'Березинский'),
(87,'Борисовский'),
(88,'Вилейский'),
(89,'Воложинский'),
(90,'Дзержинский'),
(91,'Клецкий'),
(92,'Копыльский'),
(93,'Крупский'),
(94,'Логойский'),
(95,'Любанский'),
(96,'Минский'),
(97,'Минск - Заводской'),
(98,'Минск - Ленинский'),
(99,'Минск - Московский'),
(100,'Минск - Октябрьский'),
(101,'Минск - Партизанский'),
(102,'Минск - Первомайский'),
(103,'Минск - Советский'),
(104,'Минск - Фрунзенский'),
(105,'Минск - Центральный'),
(106,'Молодечненский'),
(107,'Мядельский'),
(108,'Несвижский'),
(109,'Пуховичский'),
(110,'Слуцкий'),
(111,'Смолевичский'),
(112,'Солигорский'),
(113,'Стародорожский'),
(114,'Столбцовский'),
(115,'Узденский'),
(116,'Червенский'),
(117,'Белыничский'),
(118,'Бобруйский'),
(119,'Бобруйск - Ленинский'),
(120,'Бобруйск - Первомайский'),
(121,'Быховский'),
(122,'Глусский'),
(123,'Горецкий'),
(124,'Дрибинский'),
(125,'Кировский'),
(126,'Климовичский'),
(127,'Кличевский'),
(128,'Костюковичский'),
(129,'Краснопольский'),
(130,'Кричевский'),
(131,'Круглянский'),
(132,'Могилевский'),
(133,'Могилев - Ленинский'),
(134,'Могилев - Октябрьский'),
(135,'Мстиславский'),
(136,'Осиповичский'),
(137,'Славгородский'),
(138,'Хотимский'),
(139,'Чаусский'),
(140,'Чериковский'),
(141,'Шкловский');
